In [1]:
import pandas as pd

In [2]:
# Consider following code to answer further questions:

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df       # this is Given

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

# Q1. Write a code to print the data present in the second row of the dataframe, df.

In [4]:
df.loc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

# Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

iloc is integer index-based. So here, we have to specify rows and columns by their integer index.
df.iloc[0:2, 0:2] selects the first two rows and first two columns of the DataFrame based


loc is label-based, which means that we have to specify the name of the rows and columns that we need to filter out.
For example, df.loc[0:2, 'column_name'] selects the rows with indices 0, 1, and 2 and the column with label

# Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2].

In [5]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [6]:
new_df = df.reindex([3,0,1,2])

In [7]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [8]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [9]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

<!--  Did you observe any difference in both the outputs? If so then explain it. -->

iloc is integer index-based whereas loc is label-based

In [10]:
# Consider the below code to answer further questions:




import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [11]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.723134  0.979985  0.230223  0.533771  0.477228  0.025292
2  0.158090  0.024705  0.491219  0.279570  0.432140  0.182379
3  0.571252  0.099538  0.595895  0.283913  0.848637  0.839759
4  0.993581  0.646029  0.325521  0.733329  0.568657  0.750857
5  0.479247  0.482905  0.500643  0.108674  0.587636  0.182182
6  0.911626  0.677951  0.177033  0.112016  0.279836  0.615866

# Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
           (ii) standard deviation of column, ‘column_2’

In [12]:
print("The Mean of Data Frame\n",df1.mean())

The Mean of Data Frame
 column_1    0.639488
column_2    0.485185
column_3    0.386756
column_4    0.341879
column_5    0.532356
column_6    0.432723
dtype: float64

In [13]:
print("Standar deviation of Column_2 is:\n",df1['column_2'].std())

Standar deviation of Column_2 is:
 0.36568486395671546

# Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the

mean of column, column_2.
If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [14]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.723134  0.979985  0.230223  0.533771  0.477228  0.025292
2  0.158090  0.024705  0.491219  0.279570  0.432140  0.182379
3  0.571252  0.099538  0.595895  0.283913  0.848637  0.839759
4  0.993581  0.646029  0.325521  0.733329  0.568657  0.750857
5  0.479247  0.482905  0.500643  0.108674  0.587636  0.182182
6  0.911626  0.677951  0.177033  0.112016  0.279836  0.615866

In [15]:
df1.loc[2] = 'krish','sudhanshu','Malaya','Aamir','Mayanak','Anmol'

In [16]:
df1

   column_1   column_2  column_3  column_4  column_5  column_6
1  0.723134   0.979985  0.230223  0.533771  0.477228  0.025292
2     krish  sudhanshu    Malaya     Aamir   Mayanak     Anmol
3  0.571252   0.099538  0.595895  0.283913  0.848637  0.839759
4  0.993581   0.646029  0.325521  0.733329  0.568657  0.750857
5  0.479247   0.482905  0.500643  0.108674  0.587636  0.182182
6  0.911626   0.677951  0.177033  0.112016  0.279836  0.615866

In [17]:
try:
    
    
    mean_df = df1.loc[2].mean()
    
    
except (Exception) as e:
    print(e)

Could not convert krishsudhanshuMalayaAamirMayanakAnmol to numeric

# Q6. What do you understand about the windows function in pandas and list the types of windows functions?

1.Rolling Window: This function creates a window of a fixed size and then slides it over the data to calculate aggregates. Examples of rolling window functions include rolling_mean(), rolling_sum(), and rolling_std().

2.Expanding Window: This function starts with a window of a single data point and then expands it to include more data points. Examples of expanding window functions include expanding_sum() and expanding_mean().

3.Exponentially Weighted Window: This function gives more weight to recent data points and less weight to older data points. Examples of exponentially weighted window functions include ewma() and ewmstd().

4.Cumulative Window: This function calculates the cumulative sum or product of the values in a window. Examples of cumulative window functions include cum

# Q7. Write a code to print only the current month and year at the time of answering this question.
[Hint: Use pandas.datetime function]

In [18]:
current = pd.datetime.now()

C:\Users\Let\AppData\Local\Temp\ipykernel_8428\1836436967.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  current = pd.datetime.now()

In [19]:
current.date()

datetime.date(2023, 3, 11)

In [20]:
current.astimezone()

datetime.datetime(2023, 3, 11, 12, 55, 43, 591269, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800), 'India Standard Time'))

In [21]:
current.day

11

In [22]:
current.month

3

In [23]:
current.year

2023

# Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [24]:
date1 = input("Enter Date 1 in Form(YYYY-MM-DD)")
date2 = input("Enter Date 2 in Form(YYYY-MM-DD)")

date1 = pd.to_datetime(date1)
date2 = pd.to_datetime(date2)


time_difference = (date2 - date1)

day_time = time_difference.days
hour_time = time_difference.seconds//3600
minute_time = (time_difference.seconds%3600)//60

print("The difference is {} Days and {} hours and {} minutes".format(day_time,hour_time,minute_time))

Enter Date 1 in Form(YYYY-MM-DD)2022-01-01
Enter Date 2 in Form(YYYY-MM-DD)2023-01-01
The difference is 365 Days and 0 hours and 0 minutes

# Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

In [25]:
import pandas as pd

In [26]:
df = pd.read_csv('nba.csv')

In [27]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
file = input("Enter a CSV format File Name: ")
col = input("Enter Column Name : ")

df = pd.read_csv(file)
print("This is The Original Data (File Eneter By the User)\n\n\n",df)

cat_order_input = input("Enter category order (comma separated): ")
cat_order_list = cat_order_input.split(",")


df[col] = pd.Categorical(df[col],categories= cat_order_list,ordered=True)


df_sorted = df.sort_values(by=col)
print("This is Sorted Data \n\n\n",df_sorted)

Enter a CSV format File Name: nba.csv
Enter Column Name : Name
This is The Original Data (File Eneter By the User)


               Name            Team  Number Position   Age Height  Weight  \
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4    Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
..             ...             ...     ...      ...   ...    ...     ...
453   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0
454      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0
455   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0
456    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0
457            NaN             NaN     NaN      NaN   NaN    NaN     NaN

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0
457                NaN        NaN

[458 rows x 9 columns]
Enter category order (comma separated): Name
This is Sorted Data


     Name            Team  Number Position   Age Height  Weight  \
0    NaN  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    NaN  Boston Celtics    99.0       SF  25.0    6-6   235.0
2    NaN  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    NaN  Boston Celtics    28.0       SG  22.0    6-5   185.0
4    NaN  Boston Celtics     8.0       PF  29.0   6-10   231.0
..   ...             ...     ...      ...   ...    ...     ...
453  NaN       Utah Jazz     8.0       PG  26.0    6-3   203.0
454  NaN       Utah Jazz    25.0       PG  24.0    6-1   179.0
455  NaN       Utah Jazz    21.0        C  26.0    7-3   256.0
456  NaN       Utah Jazz    24.0        C  26.0    7-0   231.0
457  NaN             NaN     NaN      NaN   NaN    NaN     NaN

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0
457                NaN        NaN

[458 rows x 9 columns]

# Q10. Write a Python program that reads a CSV file containing sales data for different products and visualizes the data using a stacked bar chart to show the sales of each product category over time. The program should prompt the user to enter the file path and display the chart.

In [48]:
import matplotlib.pyplot as plt


file_path = input("Enter file path: ")

df = pd.read_csv(file_path)

df['Date'] = pd.to_datetime(df['Date'])

grouped = df.groupby(['Product Category', 'Date']).sum()

stacked = grouped.unstack(level=0)
stacked.columns = stacked.columns.get_level_values(1)

# Create stacked bar chart
stacked.plot(kind='bar', stacked=True, figsize=(10,5))

# Set chart title and axis labels
plt.title('Sales by Product Category')
plt.xlabel('Date')
plt.ylabel('Sales')

# Show chart
plt.show()



# Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and displays the results in a table.

In [65]:
student_data={'student id':[1,2,3,4,5,6,7,8,9,10],'test scores':[85,90,80,75,85,82,78,85,90,85]}
df =pd.DataFrame(student_data)

In [66]:
df

   student id  test scores
0           1           85
1           2           90
2           3           80
3           4           75
4           5           85
5           6           82
6           7           78
7           8           85
8           9           90
9          10           85

In [ ]:
file_path = input("Enter the file path of the CSV file containing the student data: ")

# Read CSV file into a Pandas DataFrame
df = pd.read_csv(file_path)

# Calculate mean, median, and mode of the test scores
mean_score = df['Test Score'].mean()
median_score = df['Test Score'].median()
mode_score = df['Test Score'].mode()

# Display the results in a table
results = pd.DataFrame({'Statistic': ['Mean', 'Median', 'Mode'],
                        'Value': [mean_score, median_score, list(mode_score)]})
print(results.to_string(index=False))

Output:
    
Enter the file path of the CSV file containing the student data: student_data.csv
 Statistic      Value
      Mean      82.0
    Median      82.0
      Mode      [85.0, 90.0]